--  Diseases
insert into diseases values (1,'2023-08-05', '2023-08-05','INFECTION','Чума');
insert into diseases values (2,'2023-08-05', '2023-08-05','INFECTION','Туляремія');
insert into diseases values (3,'2023-08-05', '2023-08-05','INFECTION','Бруцельоз');
insert into diseases values (4,'2023-08-05', '2023-08-05','INFECTION','Сибірка');
insert into diseases values (5,'2023-08-05', '2023-08-05','INFECTION','Бореліоз');


--Drugs
insert into drugs values (default,'2023-08-05', '2023-08-05', 'A-280-360', 'антибіотик, що діє бактеріостатично, інгібуючи синтез бактеріального білка за рахунок зв''язування з 50S-субодиницею рибосом. Препарат має широкий спектр антибактеріальної дії. До азитроміцину чутливі стрептококи, метицилінчутливі стафілококи, хламідії, легіонелли, клостридії, Haemophilus influenzae, Moraxella catarrhalis, пастерелла, фузобактерії, Porphyromonas, бліда спірохета, лістерія, борелія, нейсерії, сальмонели, шиґелли, єрсінії, Escherichia coli, Bordetella pertussis, Helicobacter pylori, мікоплазми, пептококи, пептострептококи. Нечутливими до азитроміцину є метицилінрезистентні стафілококи, ентерококи, більшість анаеробних бактерій.','г', 0.25,'ANTIBIOTICS', 'Азітроміцин',30);
insert into drugs values (default,'2023-08-05', '2023-08-05', 'N-347-122', 'безбарвні голчасті кристали моноклінної структури, у чистому вигляді без запаху, але у вологому середовищі (наприклад при контакті з повітрям) набуває запаху оцтової кислоти. Одержують взаємодією оцтового ангідриду та саліцилової кислоти. Вживають як протизапальний, знеболювальний, жарознижувальний та антиагрегантний засіб.','г', 0.5,'ANALGESICS', 'Ацетилсаліцилова кислота',100);
insert into drugs values (default,'2023-08-05', '2023-08-05', 'J-456-652', 'напівсинтетичний антибіотик з групи цефалоспоринів ІІІ покоління для парентерального введення широкого спектра дії. Цефтріаксон уперше синтезовано у лабораторії швейцарської компанії Hoffmann-La Roche[2], яка розпочала його випуск під торговою маркою «Роцефін». Цефтріаксон використовується у клінічній практиці з 1982 року.[3] Цефтріаксон, на думку багатьох експертів, вважається найуспішнішим із цефалоспоринів ІІІ покоління.','г', 1.0,'ANTIBIOTICS', 'Цефтріаксон',30);
insert into drugs values (default,'2023-08-05', '2023-08-05', 'V-445-212', 'Дротаверин — синтетичний препарат, що по хімічному складу є похідним ізохіноліну та структурним аналогом папаверину. Механізм дії препарату полягає в інгібуванні ферменту фосфодіестерази IV типу, яка бере участь у регуляції скорочень гладких м''язів шлунково-кишкового тракту, сечовидільної системи та міометрію.','г', 2.0,'SPASMOLYTICS', 'Дротаверин',50);
insert into drugs values (default,'2023-08-05', '2023-08-05', 'F-643-131', 'сильний опіоїд, що міститься в маку снодійному (Papaver somniferum). Використовується як знеболювальне, а також як рекреаційний наркотик та для створення інших опіоїдів..','г/кг ', 40,'ANALGESICS', 'Морфій',10);
insert into drugs values (default,'2023-08-05', '2023-08-05', 'A-567-223', 'Спіронолактон є конкурентним антагоністом альдостерону. Він впливає на дистальні канальці нирок.
Через блокаду альдостерону пригнічує затримку води та Na+ та сприяє утриманню K+, що не тільки підвищує екскрецію Na+ та Cl−, та знижує екскрецію K+ з сечею, а й знижує екскрецію H+. У результаті цього сечогінний ефект має також гіпотензивну дію.','мг/кг ', 20,'DIURETICS', 'Спироналактон',20);
insert into drugs values (default,'2023-08-05', '2023-08-05', 'G-892-584', 'Фуросемід є петльовим діуретиком швидкої дії з відносно сильним та короткочасним діуретичним ефектом. Фуросемід блокує Na+K+2CI-котранспортер, розташований у базальних мембранах клітин товстого сегмента висхідної частини петлі Генле: ефективність салуретичної дії фуросеміду, таким чином, залежить від потрапляння лікарського засобу до канальців у місцях просвітів шляхом аніонотранспортного механізму.','мкг,кг ', 100,'DIURETICS', 'Фуросемід',40);
insert into drugs values (default,'2023-08-05', '2023-08-05', 'B-355-955', 'Метамізол чинить виражену аналгетичну та жарознижувальну дію в комбінації з менш чіткою протизапальною та спазмолітичною активністю. Його ефекти є результатом пригнічення синтезу простагландинів і ендогенних алгогенів, підвищення порога збудливості в таламусі і проведення больових екстеро- і інтероцептивних імпульсів у ЦНС, а також він впливає на гіпоталамус і формування ендогенних пірогенів.','мг/кг ', 10,'SPASMOLYTICS', 'Метамізол',50);
insert into drugs values (default,'2023-08-05', '2023-08-05', 'B-452-981', 'Ванкоміцин – це трициклічний глікопептидний антибіотик, отриманий з Amycolatopsis orientalis, ефективний проти багатьох грампозитивних мікроорганізмів. Бактерицидна дія ванкоміцину полягає у пригніченні синтезу бактеріальної стінки за рахунок гальмування полімеризації глікопептидів та селективного інгібування синтезу РНК-бактерій. Перехресної резистентності між ванкоміцином та іншими антибіотиками не виникає.','мг/кг ', 25,'ANTIBIOTICS', 'Ванкоміцин',30);
insert into drugs values (default,'2023-08-05', '2023-08-05', 'R-223-561', 'Похідна речовина піразолону, блокатор циклооксигенази. Знижує утворення простагландинів із арахідонової кислоти. Відрізняється від інших блокаторів циклооксигенази незначно вираженим протизапальним ефектом при вираженій аналгетичній, жарознижувальній та спазмолітичній дії. Спазмолітична дія проявляється на гладку мускулатуру сечовивідних та жовчних шляхів.','г/кг ', 20,'ANALGESICS', 'Аналгін',89);


--  Diseases-Drug
insert into disease_drug values (1,1);
insert into disease_drug values (2,1);
insert into disease_drug values (3,1);
insert into disease_drug values (1,3);
insert into disease_drug values (1,5);

